#include <iostream>
using namespace std;

int main() {
    int n, m;

    cout << "Введите значение n: ";
    cin >> n;
    cout << "Введите значение m: ";
    cin >> m;

    int n1 = n, m1 = m;
    int n2 = n, m2 = m;
    int n3 = n, m3 = m;

    int res1 = - -m1 - ++n1;
    cout << "1) --m - ++n = " << res1 
         << " (после: n = " << n1 << ", m = " << m1 << ")\n";

    bool res2 = (m2 * n2 < n2++);
    cout << "2) m*n < n++ = " << boolalpha << res2      // записал boolalpha для вывода true/false вместо 1/0
         << " (после: n = " << n2 << ", m = " << m2 << ")\n";

    bool res3 = (n3-- > m3++);
    cout << "3) n-- > m++ = " << boolalpha << res3 
         << " (после: n = " << n3 << ", m = " << m3 << ")\n";

    return 0;
}
/*
Выводы по заданию:
    - Префиксные операции (++n, --n) меняют значение переменной ДО её участия в выражении, 
а постфиксные (n++, n--) используют старое значение, меняя его ПОСЛЕ вычисления.
    - Операции сравнения выполняются в последнюю очередь и возвращают логический тип (bool).
    - Использование инкрементов/декрементов внутри сложных выражений требует аккуратности, 
так как порядок вычислений может приводить к неочевидным результатам.
*/